frynetworks/sensmos-firmware/esp8266/src/captive_portal.cpp
/**
 * SENSMOS captive portal — port ESP8266 (zastępuje ble_config.cpp / NimBLE).
 *
 * Flow (protokół komend 1:1 z BLE, transport = HTTP na AP):
 *  1. Node bez configu → softAP "SENSMOS-<id6>" (open), IP 192.168.4.1, DNS catch-all.
 *  2. Telefon/laptop łączy się z AP; system wykrywa captive portal → strona formularza.
 *  3. Strona (JS) woła POST /api/cmd tymi samymi komendami co BLE:
 *     auth {pin} → {device_id, nonce}; [set_device_id]; register {owner, sig_wallet,
 *     backend_url, ssid, password} → {sig_esp, pubkey_esp, proof, ts}.
 *  4. RÓŻNICA vs BLE: klient portalu NIE MA internetu → nie może od razu POST-ować
 *     /v1/register do BE. Payload rejestracyjny jest PERSYSTOWANY (NVS "sensmos":
 *     reg_payload) i: (a) pokazany na stronie sukcesu (skopiuj), (b) dostępny po
 *     połączeniu z WiFi pod GET /node/reg-payload na LAN. [ZAŁOŻENIE PORTU]
 *  5. trust_round/trust_sign działają po HTTP; pole "ble_mac" atestu niesie MAC STA
 *     (8266 nie ma BT). Timing po WiFi ≈ dowód obecności/liveness, nie odległości.
 *     [ZAŁOŻENIE PORTU]
 *  6. Watchdog onboardingu (60 s na /node/confirm lub WS identify) — bez zmian.
 */
#include "ble_config.h"
#include "wifi_manager.h"
#include "geolocation.h"       // geoloc_store — lokalizacja z telefonu przez portal
#include "identity.h"
#include "log.h"
#include "http_internal.h"     // extern WebServer server (rejestracja trasy LAN po WiFi)
#include "config.h"            // DEFAULT_BACKEND_URL
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <DNSServer.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <mbedtls/sha256.h>
#include "esp_random.h"
#include "esp_mac.h"

// ── Watchdog ──────────────────────────────────────────────────
// 60 s po WiFi na potwierdzenie onboardingu, potem powrót do provisioningu. Potwierdzenie =
// lokalny POST /node/confirm od apki ALBO udany WS identify.
static unsigned long s_wdg_deadline = 0;
static bool          s_wdg_active   = false;
static bool          s_wdg_confirmed= false;

void watchdog_start() {
    Preferences p;
    p.begin("sensmos", true);
    bool already = p.getBool("node_confirmed", false);
    p.end();
    if (already) {
        s_wdg_active    = false;
        s_wdg_confirmed = true;
        LOGD("wdg", "node already confirmed — inactive");
        return;
    }
    s_wdg_deadline  = millis() + 60UL * 1000;
    s_wdg_active    = true;
    s_wdg_confirmed = false;
    LOGI("wdg", "armed — 60s for /node/confirm");
}
void watchdog_confirm() {
    if (s_wdg_confirmed) return;
    s_wdg_confirmed = true;
    Preferences p;
    p.begin("sensmos", false);
    p.putBool("node_confirmed", true);
    p.end();
    LOGI("wdg", "confirmed and saved");
}
void watchdog_tick() {
    if (!s_wdg_active || s_wdg_confirmed) return;
    if (millis() > s_wdg_deadline) {
        // Onboarding nie domknął się → wróć do provisioningu. TOŻSAMOŚĆ ZOSTAJE (jak ESP32).
        LOGW("wdg", "timeout - back to portal provisioning (identity kept)");
        Preferences p;
        p.begin("sensmos", false);
        p.remove("owner_addr");
        p.remove("node_confirmed");
        p.end();
        p.begin("sensmos_wifi", false); p.clear(); p.end();
        delay(500); ESP.restart();
    }
}

// ── Globals ───────────────────────────────────────────────────
bool g_ble_active       = false;
char g_owner_address[43]= {0};
char g_backend_url[128] = {0};

static void (*s_on_wifi_ready)() = nullptr;
void ble_set_wifi_ready_cb(void (*cb)()) { s_on_wifi_ready = cb; }

// ── Internal ──────────────────────────────────────────────────
static ESP8266WebServer* s_srv = nullptr;
static DNSServer*        s_dns = nullptr;
static bool   s_auth_ok      = false;
static bool   s_wifi_pending = false;
static char   s_pin[32]      = {0};
static char   s_nonce[65]    = {0};   // 32 bajty hex
static unsigned long s_portal_start_ms = 0;
static unsigned long s_restart_at_ms   = 0;   // opóźniony restart (odpowiedź HTTP musi wyjść)

// Trust ceremony — rundy challenge-response + podpis atestu (1:1 z BLE).
#define TRUST_MAX_ROUNDS 8
#define NVS_NS_WALLET "wallet_bak"
#define ROUNDS_BUF_LEN (TRUST_MAX_ROUNDS * 128 + 1)
static char* s_rounds_buf   = nullptr;
static int   s_rounds_count = 0;

// Duże bufory na HEAP (cont-stack loop() na 8266 ma tylko 4KB!)
union PortalBuf {
    struct { char resp[256]; } auth;
    struct { char message[256]; char sig_esp_hex[145]; char pubkey_hex[131];
             char proof_input[512]; char resp[700]; } reg;
    struct { char input[140]; } round;
    struct { char attest[480]; char sig_hex[145]; char pubkey_hex[131]; char resp[512]; } sign;
    struct { char resp[700]; } wallet;
};
static PortalBuf* s_buf_p = nullptr;
#define s_buf (*s_buf_p)

// Cache skanu WiFi (zebrany PRZED softAP — skan w trybie AP bywa zawodny).
// Lazy-calloc w ble_start() (−432B .bss) — zarejestrowany node nigdy nie wchodzi w portal,
// więc nie płaci ani .bss, ani heapu. Nigdy nie zwalniany (portal kończy się ESP.restart()).
#define SCAN_MAX 12
struct ScanEnt { char ssid[33]; int16_t rssi; };
static ScanEnt* s_scan = nullptr;
static int s_scan_n = 0;

// Rate limiter (1:1 z BLE)
static unsigned long s_req_times[10] = {0};
static int           s_req_idx = 0;
static bool rate_ok() {
    unsigned long now = millis();
    int n = 0;
    for (int i = 0; i < 10; i++)
        if (s_req_times[i] && now - s_req_times[i] < 60000) n++;
    s_req_times[s_req_idx++ % 10] = now;
    return n < 10;
}

// ── Helpers ───────────────────────────────────────────────────
static void send_json(const char* json) {
    if (s_srv) s_srv->send(200, "application/json", json);
    LOGD("portal", "-> %s", json);
}
static void send_ok(const char* cmd) {
    char b[64]; snprintf_P(b, sizeof(b), PSTR("{\"status\":\"ok\",\"cmd\":\"%s\"}"), cmd);
    send_json(b);
}
static void send_err(const char* cmd, const char* msg) {
    char b[96]; snprintf_P(b, sizeof(b), PSTR("{\"status\":\"error\",\"cmd\":\"%s\",\"msg\":\"%s\"}"), cmd, msg);
    send_json(b);
}

static void gen_nonce() {
    uint8_t rnd[32];
    esp_fill_random(rnd, 32);
    bytes_to_hex(rnd, 32, s_nonce);
}

static void load_config() {
    Preferences p; p.begin("sensmos", true);
    p.getString("ble_pin",     "").toCharArray(s_pin,           sizeof(s_pin));
    p.getString("owner_addr",  "").toCharArray(g_owner_address, sizeof(g_owner_address));
    p.getString("backend_url", "").toCharArray(g_backend_url,   sizeof(g_backend_url));
    p.end();
    if (!strlen(s_pin)) strcpy(s_pin, "123456");
    if (!strlen(g_backend_url)) strcpy(g_backend_url, DEFAULT_BACKEND_URL);
}
void ble_load_config() { load_config(); }

// ── Strona portalu (PROGMEM, <4KB, zero zewnętrznych zasobów) ─
static const char PORTAL_HTML[] PROGMEM = R"HTML(<!DOCTYPE html><html><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1"><title>SENSMOS Setup</title><style>
body{font-family:-apple-system,sans-serif;margin:0;padding:16px;background:#0a0e27;color:#fff}
.c{max-width:400px;margin:24px auto}h1{font-size:22px;text-align:center}label{font-size:13px;display:block;margin-top:10px}
input,select{width:100%;padding:10px;margin:4px 0;border:1px solid #444;border-radius:4px;background:#1a1e37;color:#fff;font-size:15px;box-sizing:border-box}
button{width:100%;padding:12px;margin-top:14px;background:#00d9ff;color:#000;border:0;border-radius:4px;font-weight:bold;font-size:15px}
button:disabled{opacity:.5}.st{margin-top:14px;padding:10px;border-radius:4px;display:none;text-align:center}
.st.l{background:#1a1e37;display:block}.st.s{background:#00d944;color:#000;display:block}.st.e{background:#ff3b30;display:block}
.pl{background:#1a1e37;padding:10px;border-radius:4px;margin-top:10px;font-family:monospace;word-break:break-all;font-size:11px;max-height:180px;overflow-y:auto;display:none}
.pl.v{display:block}.cp{background:#666;color:#fff;padding:6px 10px;border:0;border-radius:3px;font-size:12px;margin-top:6px;width:auto}
</style></head><body><div class="c"><h1>SENSMOS Node Setup</h1><form id="f">
<label>PIN</label><input type="password" id="pin" value="123456">
<label>WiFi network</label><select id="ss"><option value="">Loading…</option></select>
<input type="text" id="sc" placeholder="…or type SSID manually">
<label>WiFi password</label><input type="password" id="pw">
<label>Owner wallet address (optional)</label><input type="text" id="ow" maxlength="42" placeholder="0x…">
<label>Device ID restore (optional, 64 hex)</label><input type="text" id="di" maxlength="64">
<button type="submit" id="go">Register &amp; connect</button></form>
<div class="st" id="m"></div><div class="pl" id="p"></div></div><script>
const $=i=>document.getElementById(i);const m=$('m'),p=$('p');
async function cmd(o){const r=await fetch('/api/cmd',{method:'POST',headers:{'Content-Type':'application/json'},body:JSON.stringify(o)});return r.json()}
fetch('/api/scan').then(r=>r.json()).then(d=>{$('ss').innerHTML='<option value="">Select network</option>';(d.networks||[]).forEach(n=>{const o=document.createElement('option');o.value=n.ssid;o.textContent=n.ssid+' ('+n.rssi+' dBm)';$('ss').appendChild(o)})}).catch(()=>{});
$('f').addEventListener('submit',async e=>{e.preventDefault();$('go').disabled=true;m.textContent='Registering…';m.className='st l';p.className='pl';
try{const a=await cmd({cmd:'auth',pin:$('pin').value});if(a.status!=='ok')throw Error(a.msg||'auth failed');
if($('di').value){const d=await cmd({cmd:'set_device_id',id:$('di').value});if(d.status!=='ok')throw Error(d.msg||'set_device_id failed')}
const ssid=$('sc').value||$('ss').value;if(!ssid)throw Error('choose a WiFi network');
const ow=$('ow').value;if(ow&&(!ow.startsWith('0x')||ow.length!==42))throw Error('wallet must be 0x + 40 hex (or leave blank)');
const r=await cmd({cmd:'register',owner:ow,ssid:ssid,password:$('pw').value});
if(r.status!=='ok')throw Error(r.msg||'register failed');
m.textContent='Saved! Node restarts and joins your WiFi. Submit the payload below to the backend (also at http://<node-ip>/node/reg-payload).';m.className='st s';
p.textContent=JSON.stringify(r,null,1);p.className='pl v';
const b=document.createElement('button');b.textContent='Copy payload';b.className='cp';b.onclick=()=>navigator.clipboard.writeText(JSON.stringify(r));p.appendChild(b);
}catch(err){m.textContent=err.message;m.className='st e'}finally{$('go').disabled=false}});
</script></body></html>)HTML";

// ── Komendy (protokół 1:1 z ble_config.cpp; transport HTTP) ───
static void process_cmd(const char* body) {
    if (!rate_ok()) { send_err("?", "rate_limit"); return; }
    LOGD("portal", "<- (%d B)", (int)strlen(body));

    JsonDocument doc;
    if (deserializeJson(doc, body)) { send_err("?", "invalid_json"); return; }
    const char* cmd = doc["cmd"];
    if (!cmd) { send_err("?", "no_cmd"); return; }

    // ── factory_reset ────────────────────────────────────
    if (!strcmp(cmd, "factory_reset")) {
        send_ok(cmd);
        Preferences p;
        p.begin("sensmos",      false); p.clear(); p.end();
        p.begin("sensmos_wifi", false); p.clear(); p.end();
        p.begin("sensmos_api",  false); p.clear(); p.end();
        // wallet_bak NIE czyszczone — kopia portfela przeżywa reset
        s_restart_at_ms = millis() + 800;
        return;
    }

    // ── auth {pin} ────────────────────────────────────────
    if (!strcmp(cmd, "auth")) {
        const char* pin = doc["pin"];
        if (!pin) { send_err(cmd, "missing_pin"); return; }

        bool first;
        { Preferences p; p.begin("sensmos", true); first = !p.isKey("ble_pin"); p.end(); }

        if (first) {
            Preferences p; p.begin("sensmos", false);
            p.putString("ble_pin", pin); p.end();
            strncpy(s_pin, pin, sizeof(s_pin)-1);
        } else if (strcmp(pin, s_pin)) {
            send_err(cmd, "wrong_pin"); return;
        }

        s_auth_ok = true;
        gen_nonce();
        s_rounds_buf[0] = '\0';
        s_rounds_count  = 0;

        char* resp = s_buf.auth.resp;
        snprintf_P(resp, sizeof(s_buf.auth.resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"auth\","
            "\"device_id\":\"%s\",\"nonce\":\"%s\",\"first_time\":%s}"),
            g_device_id, s_nonce, first ? "true" : "false");
        send_json(resp);
        return;
    }

    if (!s_auth_ok) { send_err(cmd, "not_authenticated"); return; }

    // ── set_device_id {id} — odtworzenie ID po reflashu ──
    if (!strcmp(cmd, "set_device_id")) {
        const char* id = doc["id"];
        if (!id || !identity_set_override(id)) { send_err(cmd, "bad_id"); return; }
        char resp[160];
        snprintf_P(resp, sizeof(resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"set_device_id\",\"device_id\":\"%s\"}"),
            g_device_id);
        send_json(resp);
        return;
    }

