frynetworks/sensmos-firmware/esp8266/src/captive_portal.cpp
    // ── register {ssid, password, [owner]} ──
    // v0.2.0: backend_url wkompilowany (DEFAULT_BACKEND_URL) — user go nie wpisuje.
    // owner/sig_wallet opcjonalne: bez portfela node rejestruje sie jako nieprzypisany.
    if (!strcmp(cmd, "register")) {
        const char* owner       = doc["owner"] | "";
        const char* ssid        = doc["ssid"];
        const char* password    = doc["password"] | "";

        // ssid opcjonalny: pusty + WiFi juz skonfigurowane => aktualizacja SAMEJ lokalizacji
        // (telefon ustawia GPS bez wpisywania hasla WiFi). Z ssid => pelne provisionowanie.
        bool have_ssid = ssid && strlen(ssid);
        if (!have_ssid && !wifi_has_config())        { send_err(cmd, "missing_ssid"); return; }
        if (strlen(owner) && strlen(owner) != 42)    { send_err(cmd, "bad_owner"); return; }

        strncpy(g_owner_address, owner,               sizeof(g_owner_address)-1);
        strncpy(g_backend_url,   DEFAULT_BACKEND_URL, sizeof(g_backend_url)-1);
        if (have_ssid) wifi_save_config(ssid, password);   // bez ssid: zostaja obecne creds
        yield();   // karm WDT: handler robi 4 namespace'y NVS + ECDSA bez feedu → HW WDT

        // Lokalizacja z telefonu (opcjonalna) — PO wifi_save_config, z KANONICZNYM
        // g_wifi_ssid (przycietym). geoloc_boot_attempt trzyma manualna lokalizacje tylko
        // gdy zapisany ssid == g_wifi_ssid po reboot'cie; uzycie surowego ssid z JSON
        // (nieprzyciety) grozilo niedopasowaniem → IP-geoloc nadpisywalby GPS telefonu.
        if (doc["lat"].is<float>() && doc["lon"].is<float>()) {
            float lat = doc["lat"] | 999.0f;
            float lon = doc["lon"] | 999.0f;
            if (lat >= -90.0f && lat <= 90.0f && lon >= -180.0f && lon <= 180.0f &&
                !(lat == 0.0f && lon == 0.0f)) {
                uint32_t acc = doc["acc"] | 10;
                char latS[16], lonS[16];
                snprintf_P(latS, sizeof(latS), PSTR("%.6f"), (double)lat);
                snprintf_P(lonS, sizeof(lonS), PSTR("%.6f"), (double)lon);
                if (geoloc_store(latS, lonS, acc, "manual", g_wifi_ssid))
                    LOGI("portal", "location set from phone: lat=%s lon=%s acc=%um",
                         latS, lonS, (unsigned)acc);
            }
            yield();
        }
        LOGI("portal", "config: backend=%s ssid=%s owner=%s", g_backend_url,
             have_ssid ? ssid : "(kept)", strlen(owner) ? owner : "(unclaimed)");

        Preferences p; p.begin("sensmos", false);
        p.putString("owner_addr",  owner);
        p.putString("backend_url", DEFAULT_BACKEND_URL);
        p.end();
        yield();

        // Challenge-Response — message podpisywany dokładnie jak w BLE
        char* message = s_buf.reg.message;
        snprintf_P(message, sizeof(s_buf.reg.message),
            PSTR("{\"device_id\":\"%s\",\"owner\":\"%s\",\"nonce\":\"%s\",\"ts\":0}"),
            g_device_id, owner, s_nonce);

        uint8_t msg_hash[32];
        sha256_string(message, msg_hash);
        yield();

        uint8_t sig_raw[72]; size_t sig_len = 0;
        char* sig_esp_hex = s_buf.reg.sig_esp_hex; sig_esp_hex[0] = 0;
        if (identity_sign(msg_hash, sig_raw, &sig_len)) {   // ECDSA secp256k1 — najdłuższy krok
            bytes_to_hex(sig_raw, sig_len, sig_esp_hex);
        }
        yield();

        char* pubkey_hex = s_buf.reg.pubkey_hex;
        identity_get_pubkey_hex(pubkey_hex, sizeof(s_buf.reg.pubkey_hex));

        // proof = sha256(nonce + sig_esp_hex + device_id)
        char* proof_input = s_buf.reg.proof_input;
        snprintf_P(proof_input, sizeof(s_buf.reg.proof_input), PSTR("%s%s%s"),
            s_nonce, sig_esp_hex, g_device_id);
        uint8_t proof_hash[32];
        sha256_string(proof_input, proof_hash);
        char proof_hex[65] = {0};
        bytes_to_hex(proof_hash, 32, proof_hex);

        char* resp = s_buf.reg.resp;
        snprintf_P(resp, sizeof(s_buf.reg.resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"register\","
            "\"sig_esp\":\"%s\",\"pubkey_esp\":\"%s\",\"proof\":\"%s\",\"ts\":%lu}"),
            sig_esp_hex, pubkey_hex, proof_hex, millis()/1000);

        // ZAŁOŻENIE PORTU: klient portalu nie ma internetu → payload rejestracyjny
        // persystowany; po WiFi dostępny pod GET /node/reg-payload (LAN).
        {
            char payload[900];
            snprintf_P(payload, sizeof(payload),
                PSTR("{\"message\":%s,\"sig_esp\":\"%s\",\"pubkey_esp\":\"%s\",\"proof\":\"%s\"}"),
                message, sig_esp_hex, pubkey_hex, proof_hex);
            Preferences pp; pp.begin("sensmos", false);
            pp.putString("reg_payload", payload);
            pp.end();
        }
        yield();

        LOGD("portal", "register resp: %d B", (int)strlen(resp));
        send_json(resp);
        s_wifi_pending = true;
        return;
    }

    // ── trust_round {c} ───────────────────────────────────
    if (!strcmp(cmd, "trust_round")) {
        const char* c = doc["c"];
        if (!c || strlen(c) < 16 || strlen(c) > 64) {
            send_err(cmd, "bad_challenge"); return;
        }
        if (s_rounds_count >= TRUST_MAX_ROUNDS) {
            send_err(cmd, "too_many_rounds"); return;
        }
        char* input = s_buf.round.input;
        snprintf_P(input, sizeof(s_buf.round.input), PSTR("%s%s"), c, g_device_id);
        uint8_t h[32];
        sha256_string(input, h);
        char r_hex[65];
        bytes_to_hex(h, 32, r_hex);
        size_t used = strlen(s_rounds_buf);
        snprintf_P(s_rounds_buf + used, ROUNDS_BUF_LEN - used, PSTR("%s%s"), c, r_hex);
        s_rounds_count++;
        char resp[128];
        snprintf_P(resp, sizeof(resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"trust_round\",\"r\":\"%s\",\"i\":%d}"),
            r_hex, s_rounds_count);
        send_json(resp);
        return;
    }

    // ── trust_sign {seed, owner, resume?, gps?} ───────────
    if (!strcmp(cmd, "trust_sign")) {
        const char* seed   = doc["seed"];
        const char* owner  = doc["owner"];
        bool        resume = doc["resume"] | false;
        if (!seed || strlen(seed) < 16 || strlen(seed) > 64) { send_err(cmd, "bad_seed"); return; }
        if (!owner || strlen(owner) < 20) { send_err(cmd, "missing_owner"); return; }

        uint8_t nrnd[8]; char nonce_hex[17];
        esp_fill_random(nrnd, 8);
        bytes_to_hex(nrnd, 8, nonce_hex);

        char rounds_hex[65];
        if (s_rounds_count > 0) {
            uint8_t rh[32];
            sha256_string(s_rounds_buf, rh);
            bytes_to_hex(rh, 32, rounds_hex);
        } else {
            strcpy(rounds_hex, "-");
        }

        // 8266: brak BT → pole "ble_mac" atestu niesie MAC STA [ZAŁOŻENIE PORTU]
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_BT);
        char ble_mac[18];
        snprintf_P(ble_mac, sizeof(ble_mac), PSTR("%02x:%02x:%02x:%02x:%02x:%02x"),
                 mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        char efuse_mac[13];
        bytes_to_hex(mac, 6, efuse_mac);

        unsigned long up = millis() / 1000;

        const char* gps_lat = doc["gps_lat"] | "";
        const char* gps_lon = doc["gps_lon"] | "";
        bool has_gps = strlen(gps_lat) > 0 && strlen(gps_lon) > 0 &&
                       strlen(gps_lat) < 16 && strlen(gps_lon) < 16;

        char* attest = s_buf.sign.attest;
        if (has_gps) {
            snprintf_P(attest, sizeof(s_buf.sign.attest),
                PSTR("{\"v\":2,\"device_id\":\"%s\",\"owner\":\"%s\","
                "\"seed\":\"%s\",\"nonce\":\"%s\",\"ble_mac\":\"%s\","
                "\"efuse_mac\":\"%s\",\"rounds\":\"%s\",\"uptime_s\":%lu,"
                "\"gps_lat\":\"%s\",\"gps_lon\":\"%s\"}"),
                g_device_id, owner, seed, nonce_hex, ble_mac,
                efuse_mac, rounds_hex, up, gps_lat, gps_lon);
        } else {
            snprintf_P(attest, sizeof(s_buf.sign.attest),
                PSTR("{\"v\":1,\"device_id\":\"%s\",\"owner\":\"%s\","
                "\"seed\":\"%s\",\"nonce\":\"%s\",\"ble_mac\":\"%s\","
                "\"efuse_mac\":\"%s\",\"rounds\":\"%s\",\"uptime_s\":%lu}"),
                g_device_id, owner, seed, nonce_hex, ble_mac,
                efuse_mac, rounds_hex, up);
        }

        uint8_t ah[32];
        sha256_string(attest, ah);
        uint8_t sig_raw[72]; size_t sig_len = 0;
        char* sig_hex = s_buf.sign.sig_hex; sig_hex[0] = 0;
        if (!identity_sign(ah, sig_raw, &sig_len)) {
            send_err(cmd, "sign_failed"); return;
        }
        bytes_to_hex(sig_raw, sig_len, sig_hex);

