frynetworks/sensmos-firmware/esp8266/src/captive_portal.cpp
        char* pubkey_hex = s_buf.sign.pubkey_hex;
        identity_get_pubkey_hex(pubkey_hex, sizeof(s_buf.sign.pubkey_hex));

        char* resp = s_buf.sign.resp;
        snprintf_P(resp, sizeof(s_buf.sign.resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"trust_sign\","
            "\"n\":\"%s\",\"bm\":\"%s\",\"em\":\"%s\",\"rd\":\"%s\","
            "\"up\":%lu,\"sig\":\"%s\",\"pk\":\"%s\",\"gv\":%d}"),
            nonce_hex, ble_mac, efuse_mac, rounds_hex, up,
            sig_hex, pubkey_hex, has_gps ? 2 : 1);

        LOGD("portal", "trust_sign: %d rounds, resp %d B%s",
            s_rounds_count, (int)strlen(resp), resume ? " (resume)" : "");

        s_rounds_buf[0] = '\0';
        s_rounds_count  = 0;

        send_json(resp);
        if (resume) s_wifi_pending = true;
        return;
    }

    // ── wallet_status ─────────────────────────────────────
    if (!strcmp(cmd, "wallet_status")) {
        Preferences p; p.begin(NVS_NS_WALLET, true);
        bool has = p.isKey("blob");
        String addr = p.getString("addr", "");
        p.end();
        char resp[180];
        snprintf_P(resp, sizeof(resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"wallet_status\","
            "\"has_backup\":%s,\"configured\":%s,\"addr\":\"%s\"}"),
            has ? "true" : "false",
            wifi_has_config() ? "true" : "false",
            addr.c_str());
        send_json(resp);
        return;
    }

    // ── wallet_backup {blob, addr} ────────────────────────
    if (!strcmp(cmd, "wallet_backup")) {
        const char* blob = doc["blob"];
        const char* addr = doc["addr"] | "";
        if (!blob || strlen(blob) < 16 || strlen(blob) > 600) {
            send_err(cmd, "bad_blob"); return;
        }
        Preferences p; p.begin(NVS_NS_WALLET, false);
        p.putString("blob", blob);
        p.putString("addr", addr);
        p.end();
        LOGI("portal", "wallet_backup saved (%d B, %.10s)", (int)strlen(blob), addr);
        send_ok(cmd);
        return;
    }

    // ── wallet_restore ────────────────────────────────────
    if (!strcmp(cmd, "wallet_restore")) {
        Preferences p; p.begin(NVS_NS_WALLET, true);
        String blob = p.getString("blob", "");
        String addr = p.getString("addr", "");
        p.end();
        if (blob.length() == 0) { send_err(cmd, "no_backup"); return; }
        char* resp = s_buf.wallet.resp;
        snprintf_P(resp, sizeof(s_buf.wallet.resp),
            PSTR("{\"status\":\"ok\",\"cmd\":\"wallet_restore\",\"blob\":\"%s\",\"addr\":\"%s\"}"),
            blob.c_str(), addr.c_str());
        send_json(resp);
        return;
    }

    // ── wifi_set {ssid, password} ─────────────────────────
    if (!strcmp(cmd, "wifi_set")) {
        const char* ssid = doc["ssid"];
        const char* password = doc["password"] | "";
        if (!ssid || !strlen(ssid)) { send_err(cmd, "missing_ssid"); return; }
        wifi_save_config(ssid, password);
        LOGI("portal", "WiFi changed: ssid=%s", ssid);
        send_ok(cmd);
        s_wifi_pending = true;
        return;
    }

    send_err(cmd, "unknown");
}

// ── Routes ────────────────────────────────────────────────────
static void handle_root() {
    s_srv->send_P(200, "text/html", PORTAL_HTML);
}
static void handle_captive_probe() {
    s_srv->sendHeader("Location", "http://192.168.4.1/", true);
    s_srv->send(302, "text/plain", "");
}
static void handle_scan() {
    String out = "{\"networks\":[";
    for (int i = 0; i < s_scan_n; i++) {
        if (i) out += ',';
        out += "{\"ssid\":\"";
        // proste escapowanie cudzysłowu/backslasha w SSID
        for (const char* c = s_scan[i].ssid; *c; c++) {
            if (*c == '"' || *c == '\\') out += '\\';
            out += *c;
        }
        out += "\",\"rssi\":";
        out += String((int)s_scan[i].rssi);
        out += '}';
    }
    out += "]}";
    s_srv->send(200, "application/json", out);
}
static void handle_cmd() {
    if (!s_srv->hasArg("plain")) { send_err("?", "no_body"); return; }
    process_cmd(s_srv->arg("plain").c_str());
}

// ── Public API (nazwy BLE zachowane — patrz ble_config.h) ─────
void ble_start() {
    if (g_ble_active) return;
    load_config();

    if (!s_buf_p)      s_buf_p      = (PortalBuf*)calloc(1, sizeof(PortalBuf));
    if (!s_rounds_buf) s_rounds_buf = (char*)calloc(1, ROUNDS_BUF_LEN);
    if (!s_scan)       s_scan       = (ScanEnt*)calloc(SCAN_MAX, sizeof(ScanEnt));
    if (!s_buf_p || !s_rounds_buf || !s_scan) { LOGE("portal", "buf alloc failed"); return; }

    // Pre-scan w STA ZANIM wstanie AP (skan w trybie AP bywa zawodny) → cache do pickera
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    delay(100);
    int n = WiFi.scanNetworks(false, true);
    s_scan_n = 0;
    for (int i = 0; i < n && s_scan_n < SCAN_MAX; i++) {
        String ss = WiFi.SSID(i);
        if (!ss.length()) continue;                        // ukryte pomijamy w pickerze
        bool dup = false;
        for (int k = 0; k < s_scan_n; k++)
            if (!strcmp(s_scan[k].ssid, ss.c_str())) { dup = true; break; }
        if (dup) continue;
        strlcpy(s_scan[s_scan_n].ssid, ss.c_str(), sizeof(s_scan[0].ssid));
        s_scan[s_scan_n].rssi = (int16_t)WiFi.RSSI(i);
        s_scan_n++;
    }
    WiFi.scanDelete();
    LOGI("portal", "pre-scan: %d networks cached", s_scan_n);

    char name[24];
    snprintf_P(name, sizeof(name), PSTR("SENSMOS-%.6s"), g_device_id);

    WiFi.mode(WIFI_AP);
    WiFi.softAPConfig(IPAddress(192,168,4,1), IPAddress(192,168,4,1), IPAddress(255,255,255,0));
    WiFi.softAP(name);                                     // open AP (jak BLE bez PIN na łączu)

    if (!s_dns) s_dns = new DNSServer();
    s_dns->setErrorReplyCode(DNSReplyCode::NoError);
    s_dns->start(53, "*", IPAddress(192,168,4,1));         // captive catch-all

    if (!s_srv) s_srv = new ESP8266WebServer(80);
    s_srv->on("/", HTTP_GET, handle_root);
    s_srv->on("/api/cmd",  HTTP_POST, handle_cmd);
    s_srv->on("/api/scan", HTTP_GET,  handle_scan);
    // Sondy captive-portal (Android/iOS/Windows) → redirect na formularz
    s_srv->on("/generate_204",        handle_captive_probe);
    s_srv->on("/gen_204",             handle_captive_probe);
    s_srv->on("/hotspot-detect.html", handle_captive_probe);
    s_srv->on("/connecttest.txt",     handle_captive_probe);
    s_srv->on("/ncsi.txt",            handle_captive_probe);
    s_srv->on("/fwlink",              handle_captive_probe);
    s_srv->on("/favicon.ico", []() { s_srv->send(204, "text/plain", ""); });
    s_srv->onNotFound(handle_captive_probe);
    s_srv->begin();

    g_ble_active     = true;
    s_wifi_pending   = false;
    s_auth_ok        = false;
    s_portal_start_ms = millis();
    s_restart_at_ms  = 0;
    LOGI("portal", "started: AP %s @ 192.168.4.1 — heap %uk free, blk %uk",
         name, ESP.getFreeHeap() / 1024, ESP.getMaxFreeBlockSize() / 1024);
}

