frynetworks/sensmos-firmware/esp8266/src/captive_portal.cpp
void ble_stop() {
    if (!g_ble_active) return;
    if (s_srv) s_srv->stop();
    if (s_dns) s_dns->stop();
    WiFi.softAPdisconnect(true);
    g_ble_active = false;
    s_auth_ok    = false;
    LOGI("portal", "stopped");
}

void ble_tick() {
    if (!g_ble_active) return;

    // Portal-under-load HW WDT (rst cause:4): when a phone associates to the
    // SoftAP it floods captive-portal detection (a DNS burst + several parallel
    // TCP probes). The NONOS SDK/lwIP path servicing association+DHCP+DNS+TCP can
    // monopolise the CPU; yield() below returns INTO the SDK and hands it more
    // service windows per loop pass — the only sketch-side lever. The ~8.4s
    // hardware WDT has no direct feed API, so a true SDK-side stall is not fully
    // curable from the sketch; these bounded yields shrink the window, not a cure.
    if (s_dns) {
        for (int i = 0; i < 8; i++) {   // drain the DNS burst, bounded + fed
            s_dns->processNextRequest();
            yield();
        }
    }
    yield();
    if (s_srv) s_srv->handleClient();
    yield();

    if (s_restart_at_ms && millis() > s_restart_at_ms) {   // factory_reset — po wysłaniu odpowiedzi
        delay(200); ESP.restart();
    }

    if (s_wifi_pending) {
        // Odpowiedź HTTP już wyszła (handleClient wyżej) — chwila na ACK TCP i restart w STA
        s_wifi_pending = false;
        LOGI("portal", "config saved — restarting into WiFi in 2s");
        delay(2000);
        ESP.restart();
        return;
    }

    // Tryb re-atestacji (force portal przy skonfigurowanym WiFi):
    // bez aktywności w 5 min → wróć do WiFi (jak BLE timeout na ESP32)
    if (wifi_has_config() && millis() - s_portal_start_ms > 300000UL) {
        LOGI("portal", "portal timeout — back to WiFi");
        delay(300);
        ESP.restart();
    }
}

// ── Trasa LAN po WiFi: podpisany payload rejestracyjny ────────
void portal_register_lan_routes() {
    server.on("/node/reg-payload", HTTP_GET, []() {
        Preferences p; p.begin("sensmos", true);
        String pl = p.getString("reg_payload", "");
        p.end();
        if (!pl.length()) { server.send(404, "application/json", "{\"error\":\"no_payload\"}"); return; }
        server.send(200, "application/json", pl);
    });
}
